tutorials/Verification_case/background/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "$FOAM_CASE/0/include/boundaryConditions"

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.0 0.0 0.0);

boundaryField
{
    inlet
    {
        type            waveVelocity;
        waveDictName    waveDict;
        value           uniform (0 0 0);     
    }
    
    outlet
    {
        /*
        type            waveVelocity;
        waveDictName    waveDictOpposite;
        value           uniform (0 0 0);
        */
       
	/*
	type            pressureInletOutletVelocity;
        value           uniform (0 0 0);        
        */
        
        type            waveAbsorption2DVelocity;
        absorptionDir   666.0;
        value           uniform (0 0 0);
        
    } 
    
    atmosphere
    {    
        type            slip;
        /*
        type            pressureInletOutletVelocity;
        value           $internalField;
        */
        /*
        type            fixedValue;
        value           uniform  ($U_ref 0 0);
        */
    }
      
    bottom
    {
        type            fixedValue;
        value           uniform  (0 0 0);
    }
    
    floater
    {
        type            movingWallVelocity;
        value           uniform  (0 0 0);
    }
    
    "(oversetPatch|sides)"
    {
         patchType       overset;
         type            overset;
    }
    
    walls
    {
         type            slip;//empty;
    }
}


// ************************************************************************* //
