tutorials/Verification_case/background/0.orig/zoneID
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    "(outlet|inlet|bottom|floater|atmosphere)"
    {
        type            zeroGradient;
    }
    "(oversetPatch|sides)"
    {
         patchType       overset;
         type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;//empty;
    }
  
}


// ************************************************************************* //
