tutorials/Verification_case/background/system/elementData
// Blade element data
// Divides the blade into N stations. Two stations define a span section (N-1 span sections).
// An integer number of actuator elements will be defined along each span section. 
// 18 nodes (17 elements) for the NREL 5-MW RWT
// axialDistance[m], radius[m], azimuth, chord[m], chordMount[%], twist[deg]
(0.000	 1.5000	0.000	3.3860	0.250   13.3080)
(0.000	 4.2333	0.000	3.6980	0.250   13.3080)
(0.000	 6.9667	0.000	4.0105	0.250   13.3080)
(0.000	 9.7000	0.000	4.3230	0.250   13.3080)
(0.000	13.8000	0.000	4.6045	0.250   12.3940)
(0.000	17.9000	0.000	4.5550	0.250   10.8210)
(0.000	22.0000	0.000	4.3535	0.250    9.5865)
(0.000	26.1000	0.000	4.1280	0.250    8.4030)
(0.000	30.2000	0.000	3.8775	0.250    7.1695)
(0.000	34.3000	0.000	3.6250	0.250    5.9525)
(0.000	38.4000	0.000	3.3790	0.250    4.7745)
(0.000	42.5000	0.000	3.1330	0.250    3.6565)
(0.000	46.6000	0.000	2.8870	0.250    2.7220)
(0.000	50.7000	0.000	2.6410	0.250    1.9225)
(0.000	54.8000	0.000	2.3950	0.250    1.1282)
(0.000	57.5333	0.000	2.1995	0.250    0.6165)
(0.000	60.2667	0.000	1.7525	0.250    0.2380)
(0.000	63.0000	0.000	1.0855	0.250   -0.0260)
