tutorials/Verification_case/background/system/foilData/DU40_A17
// From NREL's SOWFA
//   alpha   C_l    C_d
    (-180.00    0.000   0.0602)
    (-175.00    0.218   0.0699)
    (-170.00    0.397   0.1107)
    (-160.00    0.642   0.3045)
    (-155.00    0.715   0.4179)
    (-150.00    0.757   0.5355)
    (-145.00    0.772   0.6535)
    (-140.00    0.762   0.7685)
    (-135.00    0.731   0.8777)
    (-130.00    0.680   0.9788)
    (-125.00    0.613   1.0700)
    (-120.00    0.532   1.1499)
    (-115.00    0.439   1.2174)
    (-110.00    0.337   1.2716)
    (-105.00    0.228   1.3118)
    (-100.00    0.114   1.3378)
    ( -95.00   -0.002   1.3492)
    ( -90.00   -0.120   1.3460)
    ( -85.00   -0.236   1.3283)
    ( -80.00   -0.349   1.2964)
    ( -75.00   -0.456   1.2507)
    ( -70.00   -0.557   1.1918)
    ( -65.00   -0.647   1.1204)
    ( -60.00   -0.727   1.0376)
    ( -55.00   -0.792   0.9446)
    ( -50.00   -0.842   0.8429)
    ( -45.00   -0.874   0.7345)
    ( -40.00   -0.886   0.6215)
    ( -35.00   -0.875   0.5067)
    ( -30.00   -0.839   0.3932)
    ( -25.00   -0.777   0.2849)
    ( -24.00   -0.761   0.2642)
    ( -23.00   -0.744   0.2440)
    ( -22.00   -0.725   0.2242)
    ( -21.00   -0.706   0.2049)
    ( -20.00   -0.685   0.1861)
    ( -19.00   -0.662   0.1687)
    ( -18.00   -0.635   0.1533)
    ( -17.00   -0.605   0.1398)
    ( -16.00   -0.571   0.1281)
    ( -15.00   -0.534   0.1183)
    ( -14.00   -0.494   0.1101)
    ( -13.00   -0.452   0.1036)
    ( -12.00   -0.407   0.0986)
    ( -11.00   -0.360   0.0951)
    ( -10.00   -0.311   0.0931)
    (  -8.00   -0.208   0.0930)
    (  -6.00   -0.111   0.0689)
    (  -5.50   -0.090   0.0614)
    (  -5.00   -0.072   0.0547)
    (  -4.50   -0.065   0.0480)
    (  -4.00   -0.054   0.0411)
    (  -3.50   -0.017   0.0349)
    (  -3.00    0.003   0.0299)
    (  -2.50    0.014   0.0255)
    (  -2.00    0.009   0.0198)
    (  -1.50    0.004   0.0164)
    (  -1.00    0.036   0.0147)
    (  -0.50    0.073   0.0137)
    (   0.00    0.137   0.0113)
    (   0.50    0.213   0.0114)
    (   1.00    0.292   0.0118)
    (   1.50    0.369   0.0122)
    (   2.00    0.444   0.0124)
    (   2.50    0.514   0.0124)
    (   3.00    0.580   0.0123)
    (   3.50    0.645   0.0120)
    (   4.00    0.710   0.0119)
    (   4.50    0.776   0.0122)
    (   5.00    0.841   0.0125)
    (   5.50    0.904   0.0129)
    (   6.00    0.967   0.0135)
    (   6.50    1.027   0.0144)
    (   7.00    1.084   0.0158)
    (   7.50    1.140   0.0174)
    (   8.00    1.193   0.0198)
    (   8.50    1.242   0.0231)
    (   9.00    1.287   0.0275)
    (   9.50    1.333   0.0323)
    (  10.00    1.368   0.0393)
    (  10.50    1.400   0.0475)
    (  11.00    1.425   0.0580)
    (  11.50    1.449   0.0691)
    (  12.00    1.473   0.0816)
    (  12.50    1.494   0.0973)
    (  13.00    1.513   0.1129)
    (  13.50    1.538   0.1288)
    (  14.50    1.587   0.1650)
    (  15.00    1.614   0.1845)
    (  15.50    1.631   0.2052)
    (  16.00    1.649   0.2250)
    (  16.50    1.666   0.2467)
    (  17.00    1.681   0.2684)
    (  17.50    1.699   0.2900)
    (  18.00    1.719   0.3121)
    (  19.00    1.751   0.3554)
    (  19.50    1.767   0.3783)
    (  20.50    1.798   0.4212)
    (  21.00    1.810   0.4415)
    (  22.00    1.830   0.4830)
    (  23.00    1.847   0.5257)
    (  24.00    1.861   0.5694)
    (  25.00    1.872   0.6141)
    (  26.00    1.881   0.6593)
    (  28.00    1.894   0.7513)
    (  30.00    1.904   0.8441)
    (  32.00    1.915   0.9364)
    (  35.00    1.929   1.0722)
    (  40.00    1.903   1.2873)
    (  45.00    1.820   1.4796)
    (  50.00    1.690   1.6401)
    (  55.00    1.522   1.7609)
    (  60.00    1.323   1.8360)
    (  65.00    1.106   1.8614)
    (  70.00    0.880   1.8347)
    (  75.00    0.658   1.7567)
    (  80.00    0.449   1.6334)
    (  85.00    0.267   1.4847)
    (  90.00    0.124   1.3879)
    (  95.00    0.002   1.3912)
    ( 100.00   -0.118   1.3795)
    ( 105.00   -0.235   1.3528)
    ( 110.00   -0.348   1.3114)
    ( 115.00   -0.453   1.2557)
    ( 120.00   -0.549   1.1864)
    ( 125.00   -0.633   1.1041)
    ( 130.00   -0.702   1.0102)
    ( 135.00   -0.754   0.9060)
    ( 140.00   -0.787   0.7935)
    ( 145.00   -0.797   0.6750)
    ( 150.00   -0.782   0.5532)
    ( 155.00   -0.739   0.4318)
    ( 160.00   -0.664   0.3147)
    ( 170.00   -0.410   0.1144)
    ( 175.00   -0.226   0.0702)
    ( 180.00    0.000   0.0602)

